===
Backtick: empty
===

a := ``

---

(file
  (assignment
    (identifier)
    (expression
      (value
        (backtick)))))

===
Backtick: with basic content
===

a := `raw string ðŸ¦€`

---

(file
  (assignment
    (identifier)
    (expression
      (value
        (backtick)))))

===
Backtick: with line breaks
===

a := `
  a line break
  or more`

---

(file
  (assignment
    (identifier)
    (expression
      (value
        (backtick)))))

===
Backtick: with escape sequences
===

a := `raw \t \n \r \\ \" string`

---

(file
  (assignment
    (identifier)
    (expression
      (value
        (backtick)))))
