===
Indented backtick: empty
===

``````

---

(file
  (expression
    (value
      (indented_backtick))))

===
Indented backtick: with basic content
===

```raw string ðŸ¦€```

---

(file
  (expression
    (value
      (indented_backtick))))

===
Indented backtick: with ` inside
===

```raw string with ` inside```

---

(file
  (expression
    (value
      (indented_backtick))))

===
Indented backtick: with line breaks
===

```
  a line break
  or more```

---

(file
  (expression
    (value
      (indented_backtick))))

===
Indented backtick: with escape sequences
===

```raw \t \n \r \\ \" string```

---

(file
  (expression
    (value
      (indented_backtick))))
