===
Module: just a name
===

mod a

---

(file
  (mod
    (identifier)))

===
Module: just a name, optional
===

mod? a

---

(file
  (mod
    (identifier)))

===
Module: name and path
===

mod a 'b/c.just'

---

(file
  (mod
    (identifier)
    (string)))

===
Module: name and path, optional
===

mod? a "b/c.just"

---

(file
  (mod
    (identifier)
    (string)))

===
Module: with doc attribute
===

[doc]
mod a

[doc("some documentation")]
mod b

---

(file
  (mod
    (builtin_attribute)
    (identifier))
  (mod
    (builtin_attribute
      (string))
    (identifier)))
