===
Normal string: empty
===

a := ""

---

(file
  (assignment
    (identifier)
    (expression
      (value
        (string)))))

===
Normal string: with basic content
===

a := "normal string ðŸ¦€"

---

(file
  (assignment
    (identifier)
    (expression
      (value
        (string)))))

===
Normal string: with line breaks
===

a := "
  a line break
  or more"

---

(file
  (assignment
    (identifier)
    (expression
      (value
        (string)))))

===
Normal string: with escape sequences
===

a := "normal \t \n \r \\ \" \u{a1F} string"

---

(file
  (assignment
    (identifier)
    (expression
      (value
        (string
          (escape_sequence)
          (escape_sequence)
          (escape_sequence)
          (escape_sequence)
          (escape_sequence)
          (escape_sequence))))))
