===
Normal string: empty
===

""

---

(file
  (expression
    (value
      (string
        (normal_string)))))

===
Normal string: with basic content
===

"normal string ðŸ¦€"

---

(file
  (expression
    (value
      (string
        (normal_string)))))

===
Normal string: with line breaks
===

"
  a line break
  or more"

---

(file
  (expression
    (value
      (string
        (normal_string)))))

===
Normal string: with escape sequences
===

"normal \t \n \r \\ \" string"

---

(file
  (expression
    (value
      (string
        (normal_string
          (escape_sequence)
          (escape_sequence)
          (escape_sequence)
          (escape_sequence)
          (escape_sequence))))))
