===
Normal string: empty
===

""

---

(file
  (string
    (normal_string)))

===
Normal string: with basic content
===

"normal string ðŸ¦€"

---

(file
  (string
    (normal_string)))

===
Normal string: with line breaks
===

"
  a line break
  or more"

---

(file
  (string
    (normal_string)))

===
Normal string: with escape sequences
===

"normal \t \n \r \\ \" string"

---

(file
  (string
    (normal_string
      (escape_sequence)
      (escape_sequence)
      (escape_sequence)
      (escape_sequence)
      (escape_sequence))))
