===
Raw string: empty
===

''

---

(file
  (expression
    (value
      (string
        (raw_string)))))

===
Raw string: with basic content
===

'raw string ðŸ¦€'

---

(file
  (expression
    (value
      (string
        (raw_string)))))

===
Raw string: with line breaks
===

'
  a line break
  or more'

---

(file
  (expression
    (value
      (string
        (raw_string)))))

===
Raw string: with " inside
===

'
  a line "break"
  or more'

---

(file
  (expression
    (value
      (string
        (raw_string)))))

===
Raw string: with escape sequences
===

'raw \t \n \r \\ \" string'

---

(file
  (expression
    (value
      (string
        (raw_string)))))
